{
    "seasons": {
        "S01": {
            "OVERVIEW": "Season 1 of **Night City Stories** follows Alex, a nonbinary ex-corporate operative, as they become the architect of a new era in digital consciousness. Beginning as a high-level asset for Dynacorp, Alex is drawn into a conspiracy surrounding Project Echo—a secretive corporate initiative to digitize human minds. After surviving betrayal, assassination attempts, and corporate warfare, Alex assembles a team of outcasts and digital ghosts to destroy Echo and build something better: Nexus, a rebranded, ethical approach to digital immortality. The season spans tense heists, philosophical debates, and the creation of a mobile underwater AI research lab, culminating in the birth of a new digital future.",
            "CHARACTER_EVOLUTION": {
                "Alex (Protagonist / \\\"Corpo Snake\\\")": {
                    "Start": "A pragmatic, ambitious Dynacorp operative, skilled in infiltration, social engineering, and digital ops. Initially motivated by survival and self-advancement.",
                    "Transformation": "etrayed by Dynacorp, Alex fakes their own death, transitions gender, and gradually shifts from pure self-interest to a vision of shaping the future of digital consciousness. They become a leader, strategist, and ethical architect, balancing ambition with a genuine desire to avoid Echo’s mistakes.",
                    "End": "Alex is the founder of Nexus and the Echo Recovery Foundation, committed to ethical digital immortality and willing to empower others (Emilia, Nyati) to hold them accountable."
                }
            },
            "NARRATIVE_ARCS": {
                "Project Echo Conspiracy & Destructio": {
                    "Start": "Alex is hired to recover Dr. Alina Voss (later Alina), only to discover Echo’s true purpose: digitizing and controlling human minds.\\n- **Development:** Betrayal by Dynacorp, assassination attempts, and the discovery of Echo’s failures and atrocities (repurposed digital minds, corporate cover-ups)",
                    "Climax": "Alex and team infiltrate the Echo blacksite, steal and erase all data, sabotage hardware, and trigger facility-wide chaos.",
                    "Resolution": "Echo is destroyed, but the tech and its victims remain in the world."
                }
            },
            "WORLD_DEVELOPMENT": {
                "Night City & Corporate Dystopia": "A world dominated by megacorps, black markets, and digital warfare. Corporate betrayal, espionage, and off-the-books projects are the norm.",
                "Digital Consciousness": "Echo is just one of many attempts at digital immortality. The world is littered with failed experiments, rogue AIs, and black-market trafficking of digital minds."
            },
            "CONTINUITY_ANCHORS": [
                "Nexus is the new brand for digital consciousness, with a strong ethical and technical foundation.",
                "The Echo Recovery Foundation is autonomous, run by Emilia and Nyati, and is responsible for dealing with Echo’s victims.",
                "Alina is the core AI of The Ghost, with lightweight distillations for land ops (tactical or command mode)."
            ]
        }
    },
    "episodes": {
        "S01E01": {
            "OVERVIEW": "The player-character (an unnamed Dynacorp “Corpo Snake”) accepts a covert mission from executive Victor Sato to recover missing scientist Dr. Alina Voss. Moments later an assassination attempt signals the op is already compromised. Tracing the hitman’s network link leads the Snake to a gang-run server farm where they plant a back-door, steal an encrypted file called BLACKOUT PROTOCOL, and subvert an impending data-purge. Forced off-grid, the Snake flees a breached safehouse, gathers gear and misdirection tools inside Night City, then rides for the Badlands to find eccentric hacker “No-Name Pete” who can break the encryption—all while laying false trails that lure a Dynacorp response team into a fabricated crisis.",
            "TIMELINE": [
                "THEN: The episode opens with the Storyteller presenting three life-paths; the player chooses “Corpo Snake.”",
                "THEN: At the Skyline Lounge, Victor Sato offers an off-the-books extraction of Dr. Alina Voss. Accepting after probing for details, the Snake views Voss’s dossier and receives a cryptic neural warning (“Walk away…”).",
                "THEN: Exiting the lounge, the Snake’s HUD triggers a proximity alert; sniper fire smashes the streetfront. The Snake dives behind a holo-ad kiosk and contacts are denied backup."
            ],
            "CHARACTERS": {
                "Corpo Snake": "Dynacorp operative; in possession of BLACKOUT PROTOCOL; currently riding to Badlands under Nullcloak, portable decrypt unit running.",
                "Victor Sato": "High-ranking Dynacorp executive; assigned the Voss extraction, unaware of Snake’s backdoor theft; status unknown."
            },
            "PLOT_THREADS": {
                "Mission_Voss": {
                    "state": "ACTIVE",
                    "note": "Locate and extract Dr. Alina Voss."
                },
                "Assassination_Attempts": {
                    "state": "ACTIVE",
                    "note": "Unknown parties contracting hits on Snake; first sniper attack survived."
                }
            },
            "CONTINUITY_ELEMENTS": {
                "BLACKOUT PROTOCOL": "Ultra-encrypted Dynacorp data stolen from Sable Rat server; decrypt rig running (portable).",
                "Kiroshi K-512 Cyberdeck": "Vintage deck purchased for Pete; pristine condition, analog redundancy."
            }
        }
    }
}