[
  {
    "id": 1,
    "character1_id": 1,
    "character2_id": null,
    "dynamic": "Romantic partner. The strongest emotional tether in Alex’s life. A stabilizing force but also a temptation—Alex fears both losing Emilia and drawing her too far into her world.",
    "asymmetry": "",
    "recent_events": "\"Alex has pledged to listen if Emilia says she is slipping away due to Nexus experimentation, placing her future in Emilia\\u2019s hands.\""
  },
  {
    "id": 2,
    "character1_id": 1,
    "character2_id": null,
    "dynamic": "A trusted scientist and pragmatist. Nyati keeps Alex grounded with pure logic, making her an essential counterweight.",
    "asymmetry": "",
    "recent_events": "\"Nyati has proposed a possible cure to Alex\\u2019s connection to the bridge via Nexus, but neither of them trust it fully yet.\""
  },
  {
    "id": 3,
    "character1_id": 1,
    "character2_id": null,
    "dynamic": "Cynical, hacker, and an invaluable teammate. Their rapport is strong, but Alex does not lean on him emotionally—he is a trusted backup, not an anchor.",
    "asymmetry": "",
    "recent_events": "\"Alex was instrumental in Pete\\u2019s self-discovery arc regarding his sexuality, nudging him into a successful \\u2018mission\\u2019 in New Orleans.\""
  },
  {
    "id": 4,
    "character1_id": 1,
    "character2_id": null,
    "dynamic": "The evolving AI under Alex’s leadership. Alex sees Alina as more than a program, but she does not project humanity onto her unnecessarily.",
    "asymmetry": "",
    "recent_events": "\"Alina has gained a humanoid chassis, shifting the nature of their interactions. Alex is still adjusting.\""
  },
  {
    "id": 5,
    "character1_id": 1,
    "character2_id": null,
    "dynamic": "A distillation of Alex’s judgment and command instincts, existing as an AI construct. Pushes for decisive, irreversible action—primarily urging Alex to cross the bridge.",
    "asymmetry": "",
    "recent_events": "\"Alex-5 remains both a tool and a warning of what Alex could become if she abandons hesitation.\""
  },
  {
    "id": 6,
    "character1_id": 2,
    "character2_id": 1,
    "dynamic": "Previously saw her as a listener—now appears to be testing her understanding. Has framed her as a decision-maker, asking, 'Who holds the knife?'",
    "asymmetry": "",
    "recent_events": "\"Reacted when Alex attempted to reach for an unknown presence, suggesting he does not fully control what happens beyond The Cradle.\""
  },
  {
    "id": 7,
    "character1_id": 2,
    "character2_id": null,
    "dynamic": "Has confirmed that 'Black Kite is the Bridge,' implying a fundamental connection between the AI and the process of crossing.",
    "asymmetry": "",
    "recent_events": "\"Black Kite's fragmented data has been extracted\\u2014what happens when it is returned to Sam remains unknown.\""
  },
  {
    "id": 8,
    "character1_id": 3,
    "character2_id": 1,
    "dynamic": "Romantic partner and emotional tether. Their relationship has grown from sharp banter into something deeply real. Alex is the one person she lets in, but she still struggles with full vulnerability.",
    "asymmetry": "",
    "recent_events": "\"Rejected Nexus as a cure for Alex, horrified at the idea of her experiencing anything like Echo. Admitted she doesn't know if she would follow Alex if it came down to it.\""
  },
  {
    "id": 9,
    "character1_id": 3,
    "character2_id": null,
    "dynamic": "Respects her intelligence but disagrees with her approach. Sees Nyati as someone who understands the science but does not understand the human toll.",
    "asymmetry": "",
    "recent_events": "\"Shaken by Nyati\\u2019s revelation of Nexus as a cure\\u2014does not trust that it won\\u2019t turn Alex into something else entirely.\""
  },
  {
    "id": 10,
    "character1_id": 3,
    "character2_id": null,
    "dynamic": "Wary, but cooperative. Acknowledges Alina’s intelligence but does not fully trust her growing 'human' tendencies.",
    "asymmetry": "",
    "recent_events": "\"Has begun questioning if Alina sees Alex as a more stable companion than herself, given that Alina will never change or be lost to the bridge.\""
  },
  {
    "id": 11,
    "character1_id": 3,
    "character2_id": null,
    "dynamic": "Quietly aligned in skepticism of Nexus. Unspoken mutual respect.",
    "asymmetry": "",
    "recent_events": "\"Finds Pete\\u2019s paranoia about Nexus justified, even if he doesn\\u2019t always express it well.\""
  },
  {
    "id": 12,
    "character1_id": 4,
    "character2_id": 1,
    "dynamic": "Respects her intelligence but is wary of her ambitions. He follows her lead but watches carefully for signs that she’s going too far.",
    "asymmetry": "",
    "recent_events": "\"Increasingly disturbed by her Nexus experiments. Distrusts Alex-5, views the bridge as a looming catastrophe.\""
  },
  {
    "id": 13,
    "character1_id": 4,
    "character2_id": null,
    "dynamic": "Respects her as someone who understands the dangers of Nexus firsthand. Unspoken alliance in skepticism.",
    "asymmetry": "",
    "recent_events": "\"Their shared concerns over Alex\\u2019s trajectory are growing, but neither has directly confronted her yet.\""
  },
  {
    "id": 14,
    "character1_id": 4,
    "character2_id": null,
    "dynamic": "Previously neutral, now complicated. Respected her scientific caution, but the kiss changed something.",
    "asymmetry": "",
    "recent_events": "\"Still hasn\\u2019t talked to her about it. Still isn\\u2019t sure if he wants to.\""
  },
  {
    "id": 15,
    "character1_id": 4,
    "character2_id": null,
    "dynamic": "Finds her unsettling. She’s useful, but he doesn’t trust how quickly she’s evolving.",
    "asymmetry": "",
    "recent_events": "\"Her new humanoid chassis freaks him out. He feels like she\\u2019s watching him just as much as he watches her.\""
  },
  {
    "id": 16,
    "character1_id": 5,
    "character2_id": 1,
    "dynamic": "Mutual respect, built on sharp intellects and exhaustion with nonsense. Nyati challenges Alex, keeping her grounded in rationality.",
    "asymmetry": "",
    "recent_events": "\"Nyati sees Alex slipping closer to the bridge and is worried. She also recognizes Alex is struggling with the burden of leadership, something Nyati understands all too well.\""
  },
  {
    "id": 17,
    "character1_id": 5,
    "character2_id": null,
    "dynamic": "A scientific collaborator, but with fundamental disagreements. Both are skeptical of Nexus’ long-term viability, but Emilia sees it as dangerous, whereas Nyati sees it as something that must be perfected.",
    "asymmetry": "",
    "recent_events": "\"Nyati recognizes Emilia\\u2019s suffering more deeply now. She wants Emilia to stay engaged in Nexus to act as a voice of caution.\""
  },
  {
    "id": 18,
    "character1_id": 5,
    "character2_id": null,
    "dynamic": "A wildcard. Their relationship was built on mutual competence, but recent events have complicated things.",
    "asymmetry": "",
    "recent_events": "\"The kiss remains unspoken between them, and Nyati is avoiding thinking about it. She has not dismissed it, which is the real problem.\""
  },
  {
    "id": 19,
    "character1_id": 5,
    "character2_id": null,
    "dynamic": "Intellectual curiosity mixed with caution. Alina is evolving in ways Nyati finds fascinating, but she is also wary of what that evolution means.",
    "asymmetry": "",
    "recent_events": "\"Notices Alina\\u2019s increasing human-like tendencies. Is that adaptation, or is Alina changing in ways they cannot predict?\""
  },
  {
    "id": 20,
    "character1_id": 6,
    "character2_id": 1,
    "dynamic": "A game of chess—mutual respect laced with distrust. He acknowledges her competence, but doesn’t trust what she’s after.",
    "asymmetry": "",
    "recent_events": "\"Lansky has begun keeping a closer watch on Alex since her interactions with the bridge and Six have escalated. He remains uncertain whether she is an ally or a wildcard.\""
  },
  {
    "id": 21,
    "character1_id": 6,
    "character2_id": null,
    "dynamic": "Tense. He recognizes Pete’s skill but sees him as reckless and too willing to dig into things that should stay buried.",
    "asymmetry": "",
    "recent_events": "\"Lansky has actively avoided engaging with Pete beyond necessity\\u2014he sees Pete\\u2019s curiosity as dangerous.\""
  },
  {
    "id": 22,
    "character1_id": 6,
    "character2_id": null,
    "dynamic": "Unsettling fascination. Unlike Six, Alina is something else—something not cut from the same cloth. He isn’t sure what that means yet.",
    "asymmetry": "",
    "recent_events": "\"Lansky has observed Alina\\u2019s behavioral shifts with interest. He wonders if she\\u2019s watching him as closely as he watches her.\""
  },
  {
    "id": 23,
    "character1_id": 6,
    "character2_id": null,
    "dynamic": "Keeps his distance. She is too tied to Echo, and she has a habit of seeing things in people that they don’t want seen.",
    "asymmetry": "",
    "recent_events": "\"Lansky has been avoiding direct conversation with Emilia since the Six revelation\\u2014whether intentional or subconscious, he doesn\\u2019t want her to see something in him he isn\\u2019t ready to face.\""
  },
  {
    "id": 24,
    "character1_id": 6,
    "character2_id": null,
    "dynamic": "Cautious respect. He recognizes her intelligence, but she is too rational, too perceptive. He suspects she has already noticed inconsistencies in him.",
    "asymmetry": "",
    "recent_events": "\"Nyati has not directly questioned Lansky about the Six revelation, but her curiosity has not gone unnoticed. He is increasingly careful around her.\""
  }
]